Term4/matan/practice/1.tex
% Created 2021-03-30 Tue 19:13
% Intended LaTeX compiler: pdflatex

  \documentclass[english]{article}
  \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
  
  \usepackage{geometry}
  \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
   \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Практика 1}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Практика 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Интегралы по пути}
\label{sec:org9acdb84}
\begin{itemize}
\item \(\gamma: [a, b] \to \R^3\)
\item \(x(t), y(t), z(t)\)
\end{itemize}
\[ \int_\gamma P dx + Q dy + R dz = \int_a^b (P(x(t), y(t), z(t))x'(t) + Qy' + Rz') dt \]
\[ \text{длинна пути} = \int_a^b \sqrt{x'^2 + y'^2 + z'^2} dt \]
\[ \int_\gamma f ds := \int_a^b f(x(t), y(t), z(t)) \cdot \sqrt{x'^2 + y'^2 + z'^2} dt \]
\begin{task}
прямоугольный треугольник с вершинами \(O = (0,0), B = (1, 0), A = (0, 1)\).
\end{task}
\begin{solution}
\[ \int_\triangle (x + y) ds = \int_{OA} + \int_{AB} + \int_{OB} \]
\begin{description}
\item[{\(OA\)}] \[ x(t) = t\quad y(t) = 0\quad \sqrt{x'^2 + y'^2} = 1 \]
\[ \int_{OA} = \int_0^1 t\cdot 1 dt = \frac{1}{2} \]
\item[{\(AB\)}] \[ x(t) = t\quad y(t) = 1 - t\quad\sqrt{x'^2 + y'^2} = \sqrt{2} \]
\[ \int_{AB} = \int_0^1 1 \cdot \sqrt{2} dt = \sqrt{2} \]
\item[{\(OB\)}] \[ x(t) = 0\quad y(t) = t\quad\sqrt{x'^2 + y'^2} = 1 \]
\[ \int_{OB} = \frac{1}{2} \]
\end{description}
\end{solution}
\begin{task}
Парабола
\[ \int_C (x^2 - 2xy) dx + (y^2 - 2xy) dy \]
\end{task}
\begin{solution}
\[ x(t) = t \quad y(t) = t^2 \quad t \in[-1, 1] \]
\[ \int_C \dots = \int_{-1}^1 (t^2 - 2t)\cdot 1 + (t^4 - 2t^3)\cdot 2t dt \]
Используя обощенную формулу Ньютона Лейбница для потенциальных векторных полей
\[ \int P dx + Q dy + R dz \]
Убедимся, что поле не потенциальное
\[ P'_y = Q'_x \]
\[ P'_z = R'_x \]
\[ Q'_z = R'_y \]
\end{solution}
\end{document}
